In [64]:
#DemoPandas
from pandas import Series, DataFrame
import pandas as pd

#시리즈 생성
data = [1000,2000,3000]
index = ['메로나', '구구콘','하겐다즈']

s = Series(data=data, index = index)
s['구구콘']

2000

In [65]:
#멀티캠퍼스
multi = Series([31200, 33000, 32000, 32500, 32700],
               index=['2024-4-15','2024-4-16','2024-4-17','2024-4-18','2024-4-19'])
multi
#print(type(multi))

2024-4-15    31200
2024-4-16    33000
2024-4-17    32000
2024-4-18    32500
2024-4-19    32700
dtype: int64

In [66]:
multi['2024-4-15']

31200

In [67]:
#데이터프레임(주식): 파이썬 딕셔너리
data = {"foreigner":[1,2,3,4,5,6]
        ,"org":[10,20,30,40,50,60]
        ,"private":[100,200,300,400,500,600]
        ,"sratio":[1,2,3,4,5,6]
        ,"sprice":[10,20,30,40,50,60]
}
data

{'foreigner': [1, 2, 3, 4, 5, 6],
 'org': [10, 20, 30, 40, 50, 60],
 'private': [100, 200, 300, 400, 500, 600],
 'sratio': [1, 2, 3, 4, 5, 6],
 'sprice': [10, 20, 30, 40, 50, 60]}

In [68]:
dataframe = DataFrame(data)
dataframe

   foreigner  org  private  sratio  sprice
0          1   10      100       1      10
1          2   20      200       2      20
2          3   30      300       3      30
3          4   40      400       4      40
4          5   50      500       5      50
5          6   60      600       6      60

In [69]:
dataframe2 = DataFrame(data, columns=['private', 'foreigner', 'org', 'sratio', 'sprice']
                       ,index = ['2024-04-15','2024-04-16','2024-04-17','2024-04-18','2024-04-19','2024-04-20'])

dataframe2

            private  foreigner  org  sratio  sprice
2024-04-15      100          1   10       1      10
2024-04-16      200          2   20       2      20
2024-04-17      300          3   30       3      30
2024-04-18      400          4   40       4      40
2024-04-19      500          5   50       5      50
2024-04-20      600          6   60       6      60

In [70]:
#컬럼 슬라이싱(Series)
dataframe2['private']
#print(type(dataframe2['private']))

2024-04-15    100
2024-04-16    200
2024-04-17    300
2024-04-18    400
2024-04-19    500
2024-04-20    600
Name: private, dtype: int64

In [71]:
#행 슬라이스
dataframe2.loc['2024-04-15']

private      100
foreigner      1
org           10
sratio         1
sprice        10
Name: 2024-04-15, dtype: int64

In [72]:
dataframe2.T

           2024-04-15  2024-04-16  ...  2024-04-19  2024-04-20
private           100         200  ...         500         600
foreigner           1           2  ...           5           6
org                10          20  ...          50          60
sratio              1           2  ...           5           6
sprice             10          20  ...          50          60

[5 rows x 6 columns]

In [73]:
dataframe3 = dataframe2.T
dataframe3
dataframe3.loc['private']

2024-04-15    100
2024-04-16    200
2024-04-17    300
2024-04-18    400
2024-04-19    500
2024-04-20    600
Name: private, dtype: int64

In [74]:
#다른 예제(딕셔너리)
data = {
    '종목코드':['037730', '036360', '005760']
    ,'종목명':['3R', '3SOFT', 'ACTS']
    ,'현재가':[1510,1790, 11850]
}

df = DataFrame(data)
df

     종목코드    종목명    현재가
0  037730     3R   1510
1  036360  3SOFT   1790
2  005760   ACTS  11850

In [75]:
#리스트로 데이터프레임을 로딩
data = [
     ['037730', '3R', 1510]
    ,['03360', '3SOFT', 1790]
    ,['005760','ACTS', 11850]
    ]

columns = ['종목코드', '종목명', '현재가']

df2 = DataFrame(data=data, columns=columns)
df2

     종목코드    종목명    현재가
0  037730     3R   1510
1   03360  3SOFT   1790
2  005760   ACTS  11850

In [76]:
#내부에서 직접 파일 보기
!type c:\work\ex1.csv

id, name, price, description
1, iphone, 890000, iphone 6s 7 8 x
2, android, 990000, samsung phone
3, winphone, 450000, microsoft winphone

In [84]:
#import pandas as pd
#데이터 프레임
df = pd.read_csv(r"c:\work\ex1.csv")
df

   id       name   price           description
0   1     iphone  890000      iphone 6s 7 8 x
1   2    android  990000         samsung phone
2   3   winphone  450000   microsoft winphone

In [86]:
#두번째 파일
!type c:\work\ex2.csv

1, iphone, 890000, iphone 6s 7 8 x
2, android, 990000, samsung phone
3, winphone, 450000, microsoft winphone

In [91]:
df2 = pd.read_csv(r"c:\work\ex2.csv"
                  ,names=['id', 'name', 'price', 'desc'])
#df2
print(df2.shape)
print(df2)

(3, 4)
   id       name   price                  desc
0   1     iphone  890000      iphone 6s 7 8 x
1   2    android  990000         samsung phone
2   3   winphone  450000   microsoft winphone

In [94]:
#구분자가 탭문자인 경우
!type c:\work\ex3.txt

data1 data2 data3
1.2     2.3     1.3
0.1     1.5     2.5
3.1     3.2     3.3

In [108]:
#정규 표현식 : \n \t \s 
df3 = pd.read_table(r"c:\work\ex3.txt", sep="\s+")
df3

InvalidIndexError: (slice(1, None, None), 0)